Revit 2027 API
BuiltInFailures.CurtainWallFailures.NonSupportedCurtainWall Property
 Currently, only straight Walls with straight or arc edges are supported for non-rectangular Curtain Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NonSupportedCurtainWall { get; }
Public Shared ReadOnly Property NonSupportedCurtainWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NonSupportedCurtainWall {
	FailureDefinitionId^ get ();
}
static member NonSupportedCurtainWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace